rpc_examples/014_schedule_download.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-2">
  <SOAP-ENV:Header>
    <cwmp:ID SOAP-ENV:mustUnderstand="1">100</cwmp:ID>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <cwmp:Download xmlns:cwmp="urn:dslforum-org:cwmp-1-2">
      <CommandKey>twoweekdebug</CommandKey>
      <FileType>1 Firmware Upgrade Image</FileType>
      <URL>http://127.0.0.1</URL>
      <Username></Username>
      <Password></Password>
      <FileSize>0</FileSize>
      <TargetFileName></TargetFileName>
      <TimeWindowList></TimeWindowList>
    </cwmp:Download>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
